<?php
    header('content-type:text/html;charset= "utf-8"');
    //关闭错误报告
    error_reporting(0);
    //二维数组  索引数组里关联数组
    $news = array(
        array("title" => "中国无限期暂停中澳战略经济对话活动外交部回应","date" => "2021-05-06"),
        array("title" => "团结就是力量 沂蒙山区的这家银行是央行前身之一","date" => "2021-05-06"),
        array("title" => "中国无限期暂停中澳战略经济对话活动外交部回应","date" => "2021-05-06"),
        array("title" => '无限期暂停!澳撕毁"一带一路协议" 中国反制措施来了',"date" => "2021-05-06"),
        array("title" => "美国宣布放弃新冠疫苗相关知识产权 医药公司股价大跌","date" => "2021-05-06"),
        array("title" => "14城户籍人口自然负增长：东北、长三角城市在列","date" => "2021-05-06"),
        array("title" => "400多人、500多个实体被制裁 俄罗斯如何扛过了7年","date" => "2021-05-06"),
        array("title" => "触目惊心！云南滇池南岸别墅密布 成“水泥森林”","date" => "2021-05-06"),
        array("title" => '刑释人员变身村主任 一份无罪证明牵出32个"保护伞"',"date" => "2021-05-06"),
        array("title" => '五一又有人穿越"鳌太线" 这条"死亡线"已致近50人遇难',"date" => "2021-05-06"),
    );
    //将嵌套的二维数组直接转成json格式字符串输出
    echo json_encode($news);
?>
